In [2]:
# pandas stand for panel data and is the core library for data manipulation and data analysis.
# it also allow us to data cleaning and many more.
# it consist single and multidimensional data structure for data manipulation

In [3]:
# we start from series object 
# series object is one-dimensional labeled array

In [4]:
import pandas as pd
s1=pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
s1=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [6]:
s2=pd.Series({'a':1,'b':2,'c':3,'d':4,'e':5})
s2    # use like dictionary

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
s2=pd.Series({'a':1,'b':2,'c':3,'d':4,'e':5},index=['b','e','d','a','c']) 
s2   # repositing of index

b    2
e    5
d    4
a    1
c    3
dtype: int64

In [8]:
s2=pd.Series({'a':1,'b':2,'c':3,'d':4,'e':5},index=['b','e','d','a','c','f'])  
s2  # it give null value when no element is present on that index

b    2.0
e    5.0
d    4.0
a    1.0
c    3.0
f    NaN
dtype: float64

In [9]:
# extracting individual elements from a series

In [10]:
s1=pd.Series([1,2,3,4,5,6])
s1[3]   # return the value available on index no 3

s1[-3:]  # extract from last 
s1[:4] # extract from begining

0    1
1    2
2    3
3    4
dtype: int64

In [11]:
s1+5

0     6
1     7
2     8
3     9
4    10
5    11
dtype: int64

In [12]:
# all maathematics operation can be done by here like symbol of operation

In [13]:
s2=pd.Series([10,20,30,40,50,60])
s1+s2

0    11
1    22
2    33
3    44
4    55
5    66
dtype: int64

In [14]:
# Dataframe is a 2-dimensional labelled data-structure
# a data-frame comprises of rows and columns

In [15]:
import pandas as pd
pd.DataFrame({'Name':['Bob','Sam','Anne'],'Marks':[50,60,70]})

   Name  Marks
0   Bob     50
1   Sam     60
2  Anne     70

In [16]:
# built-in functions in dataframes
pankaj=pd.read_csv('biostats.csv')
pankaj.head()  # head give us first n rows of file .its default set on 5.

   Name       "Sex"   "Age"   "Height (in)"   "Weight (lbs)"
0  Alex         "M"      41              74              170
1  Bert         "M"      42              68              166
2  Carl         "M"      32              70              155
3  Dave         "M"      39              72              167
4  Elly         "F"      30              66              124

In [17]:
pankaj.tail()  # it return last five rows of file

    Name       "Sex"   "Age"   "Height (in)"   "Weight (lbs)"
13  Neil         "M"      36              75              160
14  Omar         "M"      38              70              145
15  Page         "F"      31              67              135
16  Quin         "M"      29              71              176
17  Ruth         "F"      28              65              131

In [18]:
pankaj.shape  # it return the size of file in the form of rows and column

(18, 5)

In [19]:
pankaj.describe  # it return information like mean,count etc.more for search google

<bound method NDFrame.describe of     Name       "Sex"   "Age"   "Height (in)"   "Weight (lbs)"
0   Alex         "M"      41              74              170
1   Bert         "M"      42              68              166
2   Carl         "M"      32              70              155
3   Dave         "M"      39              72              167
4   Elly         "F"      30              66              124
5   Fran         "F"      33              66              115
6   Gwen         "F"      26              64              121
7   Hank         "M"      30              71              158
8   Ivan         "M"      53              72              175
9   Jake         "M"      32              69              143
10  Kate         "F"      47              69              139
11  Luke         "M"      34              72              163
12  Myra         "F"      23              62               98
13  Neil         "M"      36              75              160
14  Omar         "M"      38              70              145
15  Page         "F"      31              67              135
16  Quin         "M"      29              71              176
17  Ruth         "F"      28              65              131>

In [20]:
# for  extracting the  values from dataset we use iloc[]

In [21]:
pankaj.iloc[0:3,0:3]  # left side of column show the rows and right side show column
# in this both 3 are exclusive means it return value from 0 to 2 .it lies in iloc

   Name       "Sex"   "Age"
0  Alex         "M"      41
1  Bert         "M"      42
2  Carl         "M"      32

In [22]:
pankaj.loc[1:10,('Name','Sex')]
#in this both 10 are inclusive  means it return value from 1 to 10 . if you write 0 instread of 1 , it return value form 0 to 10.means 11 rows

# it lies in loc

KeyError: "['Sex'] not in index"

In [ ]:
pankaj.drop('Name',axis=1) # axis=1 use for delete column

         "Sex"   "Age"   "Height (in)"   "Weight (lbs)"
0          "M"      41              74              170
1          "M"      42              68              166
2          "M"      32              70              155
3          "M"      39              72              167
4          "F"      30              66              124
5          "F"      33              66              115
6          "F"      26              64              121
7          "M"      30              71              158
8          "M"      53              72              175
9          "M"      32              69              143
10         "F"      47              69              139
11         "M"      34              72              163
12         "F"      23              62               98
13         "M"      36              75              160
14         "M"      38              70              145
15         "F"      31              67              135
16         "M"      29              71              176
17         "F"      28              65              131

In [ ]:
pankaj.drop([0,1,2,3,4,5,6,7],axis=0) # axis=0 use for delete row

    Name       "Sex"   "Age"   "Height (in)"   "Weight (lbs)"
8   Ivan         "M"      53              72              175
9   Jake         "M"      32              69              143
10  Kate         "F"      47              69              139
11  Luke         "M"      34              72              163
12  Myra         "F"      23              62               98
13  Neil         "M"      36              75              160
14  Omar         "M"      38              70              145
15  Page         "F"      31              67              135
16  Quin         "M"      29              71              176
17  Ruth         "F"      28              65              131

In [ ]:
pankaj.head(10)

   Name       "Sex"   "Age"   "Height (in)"   "Weight (lbs)"
0  Alex         "M"      41              74              170
1  Bert         "M"      42              68              166
2  Carl         "M"      32              70              155
3  Dave         "M"      39              72              167
4  Elly         "F"      30              66              124
5  Fran         "F"      33              66              115
6  Gwen         "F"      26              64              121
7  Hank         "M"      30              71              158
8  Ivan         "M"      53              72              175
9  Jake         "M"      32              69              143

In [ ]:
# some artmetic operations like mean median maximum and minimum in  dataframes

In [ ]:
pankaj.mean()  # for finding mean of column data just write mean()

/tmp/ipykernel_6702/3987145443.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  pankaj.mean()

 "Age"              34.666667
 "Height (in)"      69.055556
 "Weight (lbs)"    146.722222
dtype: float64

In [ ]:
pankaj.min()  # use min() for finding minimum

Name                     Alex
     "Sex"                "F"
 "Age"                     23
 "Height (in)"             62
 "Weight (lbs)"            98
dtype: object

In [ ]:
pankaj.median()  # use median() for finding median

/tmp/ipykernel_6702/2881633130.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  pankaj.median()

 "Age"              32.5
 "Height (in)"      69.5
 "Weight (lbs)"    150.0
dtype: float64

In [ ]:
pankaj.max()  # use max() functions to find maximum value from each column

Name                     Ruth
     "Sex"                "M"
 "Age"                     53
 "Height (in)"             75
 "Weight (lbs)"           176
dtype: object

In [42]:
pankaj.head()

   Name       "Sex"   "Age"   "Height (in)"   "Weight (lbs)"
0  Alex         "M"      41              74              170
1  Bert         "M"      42              68              166
2  Carl         "M"      32              70              155
3  Dave         "M"      39              72              167
4  Elly         "F"      30              66              124

In [55]:
new1=pd.read_csv('Iris.csv')
new1.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [56]:
def double_maker(s):  # for making  the value of any column to double half or anything make a function 
   return s*2

In [81]:
new1[['SepalLengthCm','SepalWidthCm']].apply(double_maker)  # And use apply functions to use it

     SepalLengthCm  SepalWidthCm
0             10.2           7.0
1              9.8           6.0
2              9.4           6.4
3              9.2           6.2
4             10.0           7.2
..             ...           ...
145           13.4           6.0
146           12.6           5.0
147           13.0           6.0
148           12.4           6.8
149           11.8           6.0

[150 rows x 2 columns]

In [85]:
# for finding how many value present in column of same type use value_count
new1['SepalWidthCm'].value_counts()

3.0    26
2.8    14
3.2    13
3.1    12
3.4    12
2.9    10
2.7     9
2.5     8
3.5     6
3.3     6
3.8     6
2.6     5
2.3     4
3.7     3
2.4     3
2.2     3
3.6     3
3.9     2
4.4     1
4.0     1
4.1     1
4.2     1
2.0     1
Name: SepalWidthCm, dtype: int64

In [89]:
#For sorting the elements of any column ,use sort_values by writing attributes by

new1.sort_values(by='SepalWidthCm')

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
60,61,5.0,2.0,3.5,1.0,Iris-versicolor
62,63,6.0,2.2,4.0,1.0,Iris-versicolor
119,120,6.0,2.2,5.0,1.5,Iris-virginica
68,69,6.2,2.2,4.5,1.5,Iris-versicolor
41,42,4.5,2.3,1.3,0.3,Iris-setosa
...,...,...,...,...,...,...
16,17,5.4,3.9,1.3,0.4,Iris-setosa
14,15,5.8,4.0,1.2,0.2,Iris-setosa
32,33,5.2,4.1,1.5,0.1,Iris-setosa
33,34,5.5,4.2,1.4,0.2,Iris-setosa
15,16,5.7,4.4,1.5,0.4,Iris-setosa